set_units -time 1.0ns;
set_units -capacitance 1.0pF;
create_clock -name clk -period 10.0 -waveform "0 5.0" [get_ports clk]
set_clock_uncertainty 0.200 [get_clocks clk]
set_clock_transition -rise -min 0.20 [get_clocks clk]
set_clock_transition -rise -max 0.25 [get_clocks clk]
set_clock_transition -fall -min 0.20 [get_clocks clk]
set_clock_transition -fall -max 0.25 [get_clocks clk]

set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports clk] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports vehicle_detect] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports rfid_present] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports rfid_sufficient] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports rfid_valid] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports manual_coin] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports manual_card] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports vehicle_passgate] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports maintenance_mode] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports updaterate] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports vehicle_class] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports rate_input] 
set_input_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports reset_counters] 
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports gateopen]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports gateclose]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports vehiclecount0]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports vehiclecount1]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports vehiclecount2]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports totalrevenue0]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports totalrevenue1]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports totalrevenue2]
set_output_delay -clock [get_clocks clk] -add_delay 0.3 [get_ports evasioncount]

set_max_capacitance 0.5 [all_outputs]

set_max_fanout 10 [all_inputs]
